In [5]:
import pandas as pd

In [7]:
pd.read_excel(r'C:\Users\adisa\OneDrive\Desktop\class record.xlsx')

     name         batch  rollno grade
0    alex  python=22 12      12   A++
1    kale     python=20      10     B
2  bolaji     python=19      13     A
3    wale     python=21      11    A+

In [10]:
pd.read_csv(r'C:\Users\adisa\OneDrive\Desktop\Book 1.csv')

    name grade address  phone no
0   Bayo     A   Lagos  72345747
1    Ade    A+   Lagos  75242684
2  Kunle     B    Ogun  73526377
3   Bolu   A++     Oyo  73635347

In [11]:
pd.read_csv(r'C:\Users\adisa\OneDrive\Desktop\tsvdata.txt')

      name  age  class
0  alex  9     basic 3
1  rachel 10   basic 2